// 1, 23, 42, 23, 54, 13, 4, 5, 8, 0, 7, 6

let Mas = [1, 23, 42, 23, 54, 13, 4, 5, 8, 0, 7, 6];
let res = 0;

for(i=0; i<Mas.length; i++){
  if (Mas[0] == Mas[i])
    {
      res++;
    }
  else
    {
      console.log("В массиве есть не одинаковые значения");
      break;
    }
}
if (res == Mas.length){
console.log("Все значения одинаковые в массиве");
}



/* Проверка на второе условие, когда все значения одинаковые

// 1, 23, 42, 23, 54, 13, 4, 5, 8, 0, 7, 6

let Mas = [1, 1, 1, 1, 1];
let res = 0;

for(i=0; i<Mas.length; i++){
  if (Mas[0] == Mas[i])
    {
      res++;
    }
  else
    {
      console.log("В массиве есть не одинаковые значения");
      break;
    }
}
if (res == Mas.length){
console.log("Все значения одинаковые в массиве");
}
 */